# ming = [["刘备"],
#          ["大乔"],
#          ["小乔"],
#          ["张飞"]]
# xin = [["56", "男", "106", "IBM", 500, "50"],
#          ["19", "女", "230", "微软", 501, "60"],
#          ["19", "女", "210", "Oracle", 600, "60"],
#          ["45", "男", "230", "Tencent", 700, "10"]]
# c = {}
# for i in range(len(ming)):
#     dict[ming[i]] = xin[i]
#
# print(c)
names = [
    ["刘备", "56", "男", "106", "IBM", 500, "50"],
    ["大乔", "19", "女", "230", "微软", 501, "60"],
    ["小乔", "19", "女", "210", "Oracle", 600, "60"],
    ["张飞", "45", "男", "230", "Tencent", 700, "10"]
]
dict = {}
for i in names:
    dict[i[0]] = {"年龄": i[1], "性别": i[2], "编号": i[3], "任职公司": i[4],"薪资": i[5],
                  "部门编号": i[6]}
print(dict)
